In [1]:
import pandas as pd
import numpy as np

In [6]:
data=pd.read_excel("https://data.hossam.kr/pre_sample.xlsx")

#### 데이터 확인하기

In [ ]:
size=data.shape
types=data.dtypes
print("data의 raw,column의 수 :",size)
print("------------------------------")
print("data column별 데이터 타입")
print(types)

#### 데이터 타입변경

In [ ]:
data2=data.astype({"국어":"float","수학":'str',"영어":"bool"})
data2

#### 행 혹은 열의 재배치, 이름변경

In [20]:
data=data.reindex(columns=["국어","영어","수학","과학"])

In [ ]:
data2=data.rename(columns={"국어" : "language","수학":'math',"영어":'english',"과학":"science"})
data2=data.rename(index={0:"0번"})
data2

#### 정렬

In [33]:
data4=data2.sort_values("국어")
data5=data2.sort_values("국어",ascending=False)

In [36]:
data2.query("국어>80")

    국어   영어  수학  과학
0번  98   77  88  64
1   88  120  62  72
2   92   70  83  79
6   82   88  79  90
7   90   92  81  95
8   91   90  89  80

In [ ]:
data2.query("국어>80&국어<=90")

In [40]:
data2.query("국어<80|국어>=90")

    국어  영어  수학  과학
0번  98  77  88  64
2   92  70  83  79
3   63  60  31  71
4   75  50  90  88
7   90  92  81  95
8   91  90  89  80

In [ ]:
score=int(input("숫자입력 : "))
data.query("국어> @score")

#### 열,행단위 검색

In [53]:
data["이름"]=["A","B","C","D","E","F","G","H","I"]

In [ ]:
data.reindex(columns=["이름","국어","영어","수학","과학"])

In [58]:
data.set_index("이름",inplace=True)

In [60]:
data.loc["J"]=[70,80,90,100]

In [66]:
data.loc["K"]={'국어':100,'수학':80,"윤리":90}

#### 삭제

In [ ]:
data.drop(columns=["국어"],inplace=False)

In [ ]:
data.drop("K",axis=0,inplace=False)

#### 값 추가

In [71]:
data["윤리"]=100

In [72]:
data

     국어     영어  수학     과학   윤리
이름
A    98   77.0  88   64.0  100
B    88  120.0  62   72.0  100
C    92   70.0  83   79.0  100
D    63   60.0  31   71.0  100
E    75   50.0  90   88.0  100
F    80   88.0  91   72.0  100
G    82   88.0  79   90.0  100
H    90   92.0  81   95.0  100
I    91   90.0  89   80.0  100
J    70   80.0  90  100.0  100
K   100    NaN  80    NaN  100